In [3]:
import pandas as pd
import numpy as np
foods=pd.read_csv('/Users/teisya/Desktop/Python 2 Datasets/restaurant_foods.csv')
customer=pd.read_csv('/Users/teisya/Desktop/Python 2 Datasets/restaurant_customers.csv')
week1=pd.read_csv('/Users/teisya/Desktop/Python 2 Datasets/restaurant_week_1_sales.csv')
week2=pd.read_csv('/Users/teisya/Desktop/Python 2 Datasets/restaurant_week_2_sales.csv')

In [5]:
customer.head()

   ID First Name Last Name  Gender  Company                     Occupation
0   1     Joseph   Perkins    Male  Dynazzy  Community Outreach Specialist
1   2   Jennifer   Alvarez  Female     DabZ        Senior Quality Engineer
2   3      Roger     Black    Male  Tagfeed              Account Executive
3   4     Steven     Evans    Male     Fatz               Registered Nurse
4   5       Judy  Morrison  Female  Demivee                Legal Assistant

In [6]:
week2.head()

   Customer ID  Food ID
0          688       10
1          813        7
2          495       10
3          189        5
4          267        3

In [7]:
week2.merge(customer, how="left", left_on="Customer ID", right_on="ID")

,Customer ID,Food ID,ID,First Name,Last Name,Gender,Company,Occupation
0,688,10,688,Carl,Williamson,Male,Thoughtmix,Graphic Designer
1,813,7,813,Johnny,Walker,Male,Kayveo,Developer II
2,495,10,495,Deborah,Little,Female,Babbleblab,VP Accounting
3,189,5,189,Roger,Gordon,Male,Skilith,Operator
4,267,3,267,Matthew,Wood,Male,Agimba,Product Engineer
...,...,...,...,...,...,...,...,...
245,783,10,783,Phyllis,Meyer,Female,Voolia,Information Systems Manager
246,556,10,556,Samuel,Bailey,Male,Oyoloo,Nurse
247,547,9,547,Tina,Watkins,Female,Thoughtstorm,Accountant II
248,252,9,252,Douglas,Powell,Male,Jetwire,Geologist IV
249,249,6,249,Anthony,Carpenter,Male,Shuffletag,Health Coach I

In [8]:
week2.merge(customer, how="left", left_on="Customer ID", right_on="ID").drop("ID", axis="columns")

,Customer ID,Food ID,First Name,Last Name,Gender,Company,Occupation
0,688,10,Carl,Williamson,Male,Thoughtmix,Graphic Designer
1,813,7,Johnny,Walker,Male,Kayveo,Developer II
2,495,10,Deborah,Little,Female,Babbleblab,VP Accounting
3,189,5,Roger,Gordon,Male,Skilith,Operator
4,267,3,Matthew,Wood,Male,Agimba,Product Engineer
...,...,...,...,...,...,...,...
245,783,10,Phyllis,Meyer,Female,Voolia,Information Systems Manager
246,556,10,Samuel,Bailey,Male,Oyoloo,Nurse
247,547,9,Tina,Watkins,Female,Thoughtstorm,Accountant II
248,252,9,Douglas,Powell,Male,Jetwire,Geologist IV
249,249,6,Anthony,Carpenter,Male,Shuffletag,Health Coach I

In [9]:
#left_on and right_on when the two columns dont have same name.

In [15]:
#INNER JOIN

In [16]:
#find common items

In [14]:
week1[week1["Customer ID"] == 155]

    Customer ID  Food ID
4           155        9
17          155        1

In [17]:
week2[week2["Customer ID"] == 155]

     Customer ID  Food ID
208          155        3

In [18]:
#same customer buying 3 different products

In [19]:
#INNER JOIN

In [20]:
week1.merge(week2, how="inner", on="Customer ID")

    Customer ID  Food ID_x  Food ID_y
0           537          9          5
1           155          9          3
2           503          5          8
3           503          5          9
4           155          1          3
..          ...        ...        ...
57          945          5          4
58          343          3          5
59          343          3          2
60          343          3          7
61          621          9          6

[62 rows x 3 columns]

In [22]:
#without suffix u get food id x and y which is by default, x=week1, y=week2

In [24]:
week1.merge(week2, how="inner", on="Customer ID", suffixes=[" -week 1"," -week 2"])

    Customer ID  Food ID -week 1  Food ID -week 2
0           537                9                5
1           155                9                3
2           503                5                8
3           503                5                9
4           155                1                3
..          ...              ...              ...
57          945                5                4
58          343                3                5
59          343                3                2
60          343                3                7
61          621                9                6

[62 rows x 3 columns]

In [ ]:
#MERGING BOTH CUST ID AND FOOD ID

In [25]:
foods=pd.read_csv('/Users/teisya/Desktop/Python 2 Datasets/restaurant_foods.csv')
customer=pd.read_csv('/Users/teisya/Desktop/Python 2 Datasets/restaurant_customers.csv')
week1=pd.read_csv('/Users/teisya/Desktop/Python 2 Datasets/restaurant_week_1_sales.csv')
week2=pd.read_csv('/Users/teisya/Desktop/Python 2 Datasets/restaurant_week_2_sales.csv')

In [26]:
week1.head()

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1
3          202        2
4          155        9

In [27]:
week2.head()

   Customer ID  Food ID
0          688       10
1          813        7
2          495       10
3          189        5
4          267        3

In [28]:
week1.merge(week2, how="inner", on=["Customer ID", "Food ID"])

   Customer ID  Food ID
0          304        3
1          540        3
2          937       10
3          233        3
4           21        4
5          922        1
6           21        4
7          578        5
8          578        5

In [33]:
condition_one = week2["Customer ID"] ==578
condition_two = week2["Food ID"] == 5
week2[condition_one & condition_two]

     Customer ID  Food ID
29           578        5
189          578        5